import java.util.Scanner;

public class Task1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        String[] questions = {
                "1.Какой язык программирования является самым популярным в мире?",
                "2.Какой элемент таблицы Менделеева имеет символ 'O'?",
                "3.Кто написал 'Гарри Поттера'?",
                "4.Какой океан самый большой?",
                "5.Какой год считается годом основания Рима?",
                "6.Кто изобрел телефон?",
                "7.Какой континент является самым маленьким?",
                "8.Какой газ составляет большую часть атмосферы Земли?",
                "9.Сколько планет в солнечной системе?",
                "10.Какой музыкальный инструмент имеет клавиши?"
        };
        String[][] options = {
                {"1. Python", "2. Java", "3. C++", "4. JavaScript"},
                {"1. Углерод", "2. Кислород", "3. Азот", "4. Водород"},
                {"1. Джоан Роулинг", "2. Стивен Кинг", "3. Агата Кристи", "4. Толкин"},
                {"1. Атлантический", "2. Индийский", "3. Тихий", "4. Северный"},
                {"1. 753 до н.э.", "2. 476 н.э.", "3. 1492 н.э.", "4. 1000 до н.э."},
                {"1. Эдисон", "2. Белл", "3. Тесла", "4. Фарадей"},
                {"1. Австралия", "2. Европа", "3. Азия", "4. Антарктида"},
                {"1. Азот", "2. Кислород", "3. Углекислый газ", "4. Аргон"},
                {"1. 7", "2. 8", "3. 9", "4. 10"},
                {"1. Гитара", "2. Фортепиано", "3. Скрипка", "4. Барабаны"}
        };
        int[] answers = {1, 2, 1, 3, 1, 2, 1, 1, 2, 2};
        int score = 0;
        for (int i = 0; i < questions.length; i++) {
            System.out.println(questions[i]);
            for (String option : options[i]) {
                System.out.println(option);
            }
            System.out.print("Ваш ответ: ");
            int answer = scanner.nextInt();
            if (answer == answers[i]) {
                score++;
            }
        }
        System.out.println("Вы ответили правильно на " + score + " из " + questions.length + " вопросов.");
    }
}
